// Дан массив [2, 5, 9, 15, 1, 4];
// Выведите в консоль те элементы массива,
// которые больше 3-х, но меньше 10. 
//-------------------------------------------------
// пример:
// let fruits = ["Яблоко", "Апельсин", "Слива"];
// // проходит по значениям
// for (let fruit of fruits)
//     {
//         alert( fruit );
//     }
//-------------------------------------------------
// (1)
let numbers = [2, 5, 9, 15, 1, 4];
for (let num of numbers)
    {
        if (num > 3 && num < 10) // >3 и <10
            {
                console.log(num);
            }
    }
console.log(numbers)