// for (let i = 0;
//      i < 3;
//      i++) { // выведет 0, затем 1, затем 2
//       console.log(i);
//     }

//-------------------(или)--------------------

// let N = +prompt("Введите число");
// for( let i=1; i<N; i++)
//     {
//         console.log(i);
//     }
// 

// /-----------(Последовательность чисел через for)-------

for (let i=-10; i<90; i+=10)
    {
        console.log(i)
    } // будет от -10 до 80)

//---------------------Два и более множетилей
for(let a = 0; a<10; a++) //покажет 10 таблиц
    {
        console.log(`Таблица на ${a}`)
        for(let b = 0; b<10; b++) //покажет 10 таблиц
            {
                console.log(`${a}*${b}=${a*b}`)
            }
    }   